{"Mechanical Engineering (4 Years, Bachelor of Technology)": 0, "Civil Engineering (4 Years, Bachelor of Technology)": 1, "Computer Science and Engineering (4 Years, Bachelor of Technology)": 2, "Energy Engineering with M.Tech. in Energy Systems Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 3, "Metallurgical Engineering and Materials Science (4 Years, Bachelor of Technology)": 4, "Mathematics and Computing (4 Years, Bachelor of Technology)": 5, "Production and Industrial Engineering (4 Years, Bachelor of Technology)": 6, "Biochemical Engineering and Biotechnology (5 Years, Bachelor and Master of Technology (Dual Degree))": 7, "Biotechnology and Biochemical Engineering (4 Years, Bachelor of Technology)": 8, "Chemical Engineering (4 Years, Bachelor of Technology)": 9, "Electrical Engineering (4 Years, Bachelor of Technology)": 10, "Aerospace Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 11, "Aerospace Engineering (4 Years, Bachelor of Technology)": 12, "Chemistry (5 Years, Integrated Master of Science)": 13, "Economics (5 Years, Integrated Master of Science)": 14, "Civil Engineering and M.Tech in Transportation Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 15, "Civil Engineering and M. Tech. in Structural Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 16, "Mechanical Engineering and M. Tech. in Thermal Science & Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 17, "Mathematics and Computing (5 Years, Bachelor and Master of Technology (Dual Degree))": 18, "Metallurgical and Materials Engineering (4 Years, Bachelor of Technology)": 19, "Chemistry (4 Years, Bachelor of Science)": 20, "Electrical Engineering with M.Tech. in Microelectronics (5 Years, Bachelor and Master of Technology (Dual Degree))": 21, "Agricultural and Food Engineering (4 Years, Bachelor of Technology)": 22, "Architecture (5 Years, Bachelor of Architecture)": 23, "Metallurgical Engineering and Materials Science with M.Tech. in Ceramics and Composites (5 Years, Bachelor and Master of Technology (Dual Degree))": 24, "Mechanical Engineering and M. Tech. in Mechanical System Design (5 Years, Bachelor and Master of Technology (Dual Degree))": 25, "Metallurgical Engineering and Materials Science with M.Tech. in Metallurgical Process Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 26, "Chemical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 27, "Computer Science and Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 28, "Electrical Engineering (Power and Automation) (4 Years, Bachelor of Technology)": 29, "Applied Geology (5 Years, Integrated Master of Science)": 30, "Electrical Engineering with M.Tech. in any of the listed specializations (5 Years, Bachelor and Master of Technology (Dual Degree))": 31, "Mechanical Engineering and M.Tech. in Computer Integrated Manufacturing (5 Years, Bachelor and Master of Technology (Dual Degree))": 32, "Engineering Physics (4 Years, Bachelor of Technology)": 33, "Textile Technology (4 Years, Bachelor of Technology)": 34, "Civil Engineering with any of the listed specialization (5 Years, Bachelor and Master of Technology (Dual Degree))": 35, "Electronics and Electrical Communication Engineering (4 Years, Bachelor of Technology)": 36, "Agricultural and Food Engineering with M.Tech. in any of the listed specializations (5 Years, Bachelor and Master of Technology (Dual Degree))": 37, "Electronics and Communication Engineering (4 Years, Bachelor of Technology)": 38, "Engineering Physics and M.Tech. with specialization in Nano Science (5 Years, Bachelor and Master of Technology (Dual Degree))": 39, "Electrical Engineering with M.Tech. in Communications and Signal Processing (5 Years, Bachelor and Master of Technology (Dual Degree))": 40, "Biotechnology and Biochemical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 41, "Electronics and Electrical Communication Engineering with M.Tech. in any of the listed specializations (5 Years, Bachelor and Master of Technology (Dual Degree))": 42, "Industrial and Systems Engineering (4 Years, Bachelor of Technology)": 43, "Industrial and Systems Engineering with M.Tech. in Industrial and Systems Engineering and Management (5 Years, Bachelor and Master of Technology (Dual Degree))": 44, "Exploration Geophysics (5 Years, Integrated Master of Science)": 45, "Instrumentation Engineering (4 Years, Bachelor of Technology)": 46, "Mining Engineering (4 Years, Bachelor of Technology)": 47, "Mining Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 48, "Ocean Engineering and Naval Architecture (4 Years, Bachelor of Technology)": 49, "Quality Engineering Design and Manufacturing (5 Years, Bachelor and Master of Technology (Dual Degree))": 50, "Economics (4 Years, Bachelor of Science)": 51, "Materials Science and Engineering (4 Years, Bachelor of Technology)": 52, "Biological Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 53, "Biological Sciences (5 Years, Bachelor of Science and Master of Science (Dual Degree))": 54, "Civil Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 55, "Naval Architecture and Ocean Engineering (4 Years, Bachelor of Technology)": 56, "Geophysical Technology (5 Years, Integrated Master of Technology)": 57, "Electronics and Instrumentation Engineering (4 Years, Bachelor of Technology)": 58, "Manufacturing Science and Engineering with M.Tech. in Industrial and Systems Engineering and Management (5 Years, Bachelor and Master of Technology (Dual Degree))": 59, "Mechanical Engineering with M.Tech. in any of the listed specializations (5 Years, Bachelor and Master of Technology (Dual Degree))": 60, "Physics (5 Years, Integrated Master of Science)": 61, "Engineering Science (4 Years, Bachelor of Technology)": 62, "Materials Science and Metallurgical Engineering (4 Years, Bachelor of Technology)": 63, "Earth Sciences (4 Years, Bachelor of Science)": 64, "Electrical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 65, "Engineering Design (5 Years, Bachelor and Master of Technology (Dual Degree))": 66, "Mechanical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 67, "Physics (5 Years, Bachelor of Science and Master of Science (Dual Degree))": 68, "Metallurgical and Materials Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 69, "Geological Technology (5 Years, Integrated Master of Technology)": 70, "Polymer Science and Engineering (4 Years, Bachelor of Technology)": 71, "Environmental Engineering (4 Years, Bachelor of Technology)": 72, "Mathematics and Computing (5 Years, Integrated Master of Technology)": 73, "Ocean Engineering and Naval Architecture (5 Years, Bachelor and Master of Technology (Dual Degree))": 74, "Biological Sciences and Bioengineering (4 Years, Bachelor of Technology)": 75, "Mathematics and Scientific Computing (4 Years, Bachelor of Science)": 76, "Mathematics and Computing (5 Years, Integrated Master of Science)": 77, "Physics (4 Years, Bachelor of Science)": 78, "Mineral Engineering (4 Years, Bachelor of Technology)": 79, "Applied Mathematics (5 Years, Integrated Master of Science)": 80, "Applied Geology (5 Years, Integrated Master of Technology)": 81, "Applied Geophysics (5 Years, Integrated Master of Technology)": 82, "Mining Safety Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 83, "Bio Technology (4 Years, Bachelor of Technology)": 84, "Manufacturing Science and Engineering (4 Years, Bachelor of Technology)": 85, "Naval Architecture and Ocean Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 86, "Mining Machinery Engineering (4 Years, Bachelor of Technology)": 87, "Petroleum Engineering (4 Years, Bachelor of Technology)": 88, "Bioengineering with M.Tech in Biomedical Technology (5 Years, Bachelor and Master of Technology (Dual Degree))": 89, "Ceramic Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 90, "Metallurgical Engineering (4 Years, Bachelor of Technology)": 91, "Biochemical Engineering with M.Tech. in Biochemical Engineering and Biotechnology (5 Years, Bachelor and Master of Technology (Dual Degree))": 92, "Ceramic Engineering (4 Years, Bachelor of Technology)": 93, "Electronics and Electrical Engineering (4 Years, Bachelor of Technology)": 94, "Electrical Engineering with M.Tech. in Power Electronics (5 Years, Bachelor and Master of Technology (Dual Degree))": 95, "Materials Science and Technology (5 Years, Bachelor and Master of Technology (Dual Degree))": 96, "Metallurgical Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 97, "Pharmaceutics (5 Years, Bachelor and Master of Pharmaceutics(Dual Degree))": 98, "Electronics Engineering (4 Years, Bachelor of Technology)": 99, "Engineering Physics (5 Years, Integrated Master of Technology)": 100, "Civil Engineering with M.Tech. in Structural Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 101, "Industrial Chemistry (5 Years, Integrated Master of Technology)": 102, "Pharmaceutics (4 Years, Bachelor of Pharmaceutics)": 103, "Chemical Science and Technology (4 Years, Bachelor of Technology)": 104, "Electrical Engineering and M.Tech Power Electronics and Drives (5 Years, Bachelor and Master of Technology (Dual Degree))": 105, "Mechanical Engineering with M.Tech. in Manufacturing Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 106, "Metallurgical and Materials Engineering and M.Tech. in Materials Science and Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 107, "Civil Engineering and M.Tech. in Environmental Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 108, "Industrial Chemistry (5 Years, Bachelor and Master of Technology (Dual Degree))": 109, "Pharmaceutical Engineering & Technology (5 Years, Bachelor and Master of Technology (Dual Degree))": 110, "Pharmaceutical Engineering & Technology (4 Years, Bachelor of Technology)": 111, "Engineering Physics (5 Years, Bachelor and Master of Technology (Dual Degree))": 112, "BS in Mathematics (4 Years, Bachelor of Science)": 113, "Environmental Science and Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 114, "Data Science and Engineering (4 Years, Bachelor of Technology)": 115, "Metallurgical Engineering & Materials Science (5 Years, Bachelor and Master of Technology (Dual Degree))": 116, "Bio Engineering (5 Years, Bachelor and Master of Technology (Dual Degree))": 117, "Artificial Intelligence (4 Years, Bachelor of Technology)": 118, "Bio Engineering (4 Years, Bachelor of Technology)": 119, "Electrical and Electronics Engineering (4 Years, Bachelor of Technology)": 120, "Engineering and Computational Mechanics (4 Years, Bachelor of Technology)": 121, "Materials Engineering (4 Years, Bachelor of Technology)": 122, "Biomedical Engineering (4 Years, Bachelor of Technology)": 123, "Artificial Intelligence and Data Science (4 Years, Bachelor of Technology)": 124, "Civil and Infrastructure Engineering (4 Years, Bachelor of Technology)": 125, "Mineral and Metallurgical Engineering (4 Years, Bachelor of Technology)": 126, "Biosciences and Bioengineering (4 Years, Bachelor of Technology)": 127, "Data Science and Artificial Intelligence (4 Years, Bachelor of Technology)": 128, "Energy Engineering (4 Years, Bachelor of Technology)": 129, "Applied Geology (4 Years, Bachelor of Science)": 130, "Exploration Geophysics (4 Years, Bachelor of Science)": 131, "Mathematics and Computing (4 Years, Bachelor of Science)": 132, "Computational Engineering (4 Years, Bachelor of Technology)": 133, "Biotechnology and Bioinformatics (4 Years, Bachelor of Technology)": 134, "Industrial Chemistry (4 Years, Bachelor of Technology)": 135, "Statistics and Data Science (4 Years, Bachelor of Science)": 136, "Chemical Sciences (5 Years, Bachelor of Science and Master of Science (Dual Degree))": 137, "Mathematics & Computing (5 Years, Bachelor of Science and Master of Science (Dual Degree))": 138, "Economics (5 Years, Bachelor of Science and Master of Science (Dual Degree))": 139, "Electrical Engineering (IC Design and Technology) (4 Years, Bachelor of Technology)": 140, "Chemistry with Specialization (4 Years, Bachelor of Science)": 141, "Physics with Specialization (4 Years, Bachelor of Science)": 142, "Mechatronics Engineering (4 Years, Bachelor of Technology)": 143, "Chemical and Biochemical Engineering (4 Years, Bachelor of Technology)": 144, "Interdisciplinary Sciences (5 Years, Bachelor of Science and Master of Science (Dual Degree))": 145, "Environmental Science and Engineering (4 Years, Bachelor of Technology)": 146, "B.Tech in General Engineering (4 Years, Bachelor of Technology)": 147, "B.Tech in Materials Science and Engineering (4 Years, Bachelor of Technology)": 148, "B.Tech in Mathematics and Computing (4 Years, Bachelor of Technology)": 149, "B.Tech in Microelectronics & VLSI (4 Years, Bachelor of Technology)": 150, "BS in Chemical Sciences (4 Years, Bachelor of Science)": 151, "Space Sciences and Engineering (4 Years, Bachelor of Technology)": 152, "Biological Engineering (4 Years, Bachelor of Technology)": 153, "Biological Science (4 Years, Bachelor of Science)": 154, "B. Tech in CE. - M. Tech. in Geotechnical Engineering (5 Years, B.Tech. + M.Tech./MS (Dual Degree))": 155, "B. Tech in CE. - M. Tech. in Structural Engineering (5 Years, B.Tech. + M.Tech./MS (Dual Degree))": 156, "B. Tech. (CSE) and M.Tech in CSE (5 Years, B.Tech. + M.Tech./MS (Dual Degree))": 157, "B. Tech. (ECE) -M. Tech. in VLSI (5 Years, B.Tech. + M.Tech./MS (Dual Degree))": 158, "B. Tech. (EEE)-M. Tech. in (Power &. Control) (5 Years, B.Tech. + M.Tech./MS (Dual Degree))": 159, "B. Tech. (Mathematics & Computing) M. Tech. in (Mathematics & Computing) (5 Years, B.Tech. + M.Tech./MS (Dual Degree))": 160, "B. Tech. (ME) - M. Tech. in Mechatronics (5 Years, B.Tech. + M.Tech./MS (Dual Degree))": 161, "B. Tech. (ME) - MBA (NITIE) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 162, "B.Tech. in Electronics and Communication Engineering and M.Tech. in Communication Systems (5 Years, Bachelor and Master of Technology (Dual Degree))": 163, "Artificial Intelligence and Data Engineering (4 Years, Bachelor of Technology)": 164, "Industrial Engineering and Operations Research (4 Years, Bachelor of Technology)": 165, "Artificial Intelligence and Data Analytics (4 Years, Bachelor of Technology)": 166, "Integrated Circuit Design & Technology (4 Years, Bachelor of Technology)": 167, "B.Tech (Artificial Intelligence and Data Science) - MBA in Digital Business Management (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 168, "B.Tech (Chemical Engineering) - MBA in Hospital and Health Care Management (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 169, "B.Tech (Chemical Science and Technology) - MBA in Hospital and Health Care Management (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 170, "B.Tech (Civil Engineering) - MBA (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 171, "B.Tech (Computer Science and Engineering) - MBA in Digital Business Management (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 172, "B.Tech (Electrical and Electronics Engineering) - MBA (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 173, "B.Tech (Electronics and Communication Engineering) - MBA in Hospital and Healthcare Management (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 174, "B.Tech (Engineering Physics) - MBA (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 175, "B.Tech (Mathematics and Computing) - MBA in Digital Business Management (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 176, "B.Tech (Mechanical Engineering) - MBA (IIM Mumbai) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 177, "B.Tech (Metallurgical and Materials Engineering) - MBA (IIM Bodh Gaya) (5 Years, Bachelor of Technology and MBA (Dual Degree))": 178, "BS in Economics with MBA (IIM Bodh Gaya) (5 Years, Bachelor of Science and MBA (Dual Degree))": 179}